#include<stdio.h>
#include<stdlib.h>
#include<time.h>
/*與電腦輪流擲四面骰(點數1~4)
  骰到n點走n步
  依台中>彰化>南投>雲林>嘉義>台南>高雄>屏東>台東>花蓮>宜蘭>基隆>雙北>桃園>新竹>苗栗的順序
  先回到台中者勝出
  輸入：按任意鍵進行一回合
  輸出：每完成一回合(玩家與電腦各骰一次)即輸出雙方位置
		若有一方抵達終點，印出Goal並結束遊戲*/
int main()
{
	char *Taiwan[17] = {"台中","彰化","南投","雲林","嘉義","台南","高雄","屏東","台東","花蓮","宜蘭","基隆","雙北","桃園","新竹","苗栗","台中"};
	
	printf(".*\\環島之旅/*.\n台中>彰化>南投>雲林>嘉義>台南>高雄>屏東>台東>花蓮>宜蘭>基隆>雙北>桃園>新竹>苗栗\n\n");
	
	srand ( time ( NULL ) );

	int x = 0,y = 0;

	printf("我的位置   : %s\n", Taiwan[x]);
	printf("電腦的位置 : %s\n", Taiwan[y]);
	
	do{
       		puts("\n***************************************************\n");
		puts("[ 請按任意鍵 ]\n\n");
		getchar();
		int a = (rand()%3 + 1);
		int b = (rand()%3 + 1);
		printf("我骰出   : %d\n",a);
		printf("電腦骰出 : %d\n\n",b);
		x += a;
		y += b;
                if(x > 16){
	        	x = 16;}
                if(y > 16){
	                y = 16;}
		printf("我的位置   : %s\n", Taiwan[x]);
	        printf("電腦的位置 : %s\n", Taiwan[y]);

	} while(x < 16 && y < 16);
	
	printf("\n[  G o a l !!  ]\n");
}
